In [1]:
%load_ext sql

In [2]:
%sql sqlite:///stud_db;

In [3]:
%%sql
SET SQL_SAFE_UPDATES =0;

 * sqlite:///stud_db;
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET SQL_SAFE_UPDATES =0;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [3]:
%%sql CREATE TABLE personal_details (
national_ID INTEGER(15) , stud_ID VARCHAR(15),stud_name VARCHAR(100),
phone_number VARCHAR(15),age INTEGER, gender VARCHAR(10),
PRIMARY KEY(national_ID) );

 * sqlite:///stud_db;
Done.

[]

In [4]:
%%sql
INSERT INTO personal_details (national_ID,stud_ID,stud_name,phone_number,age,gender)
VALUES("344534","stud101","Hermione Granger" ,"0712345678",20,"Male"),
("379683","stud102","Draco Malfo" ,"0723456781",21,"Female"),
("347403","stud103","Jayden Wamashati" ,"0734567812",22,"Male"),
("377302","stud104","Ron Weasley" ,"0745678123",19,"Female"),
("336741","stud105","Dolores Umbridge" ,"0756781234",21,"Male"),
("307243","stud106","Hedwig Tonks" ,"0767812345",21,"Female"),
("310932","stud107","Chao Chang" ,"0778123456",22,"Male"),
("343920","stud108","Curfew Yaeitpm" ,"0781234567",20,"Female"),
("345261","stud109","Chaptr Mukenya" ,"0722345678",20,"Male"),
("339152","stud110","Natalie Mpema" ,"0733456781",21,"Female"),
("339746","stud111","Crew Nundi" ,"0744567812",20,"Male"),
("336373","stud112","Bandi Kagunda" ,"0755678123",22,"Female"),
("325252","stud113","Testimony Omolo" ,"0766456781",21,"Male"),
("321746","stud114","Career Mpya" ,"0741367812",20,"Male"),
("390234","stud115","Deamon Anduro" ,"0744421123",22,"Female");

 * sqlite:///stud_db;
15 rows affected.

[]

In [5]:
%%sql CREATE TABLE school_details(stud_ID VARCHAR(15), current_home_county VARCHAR(20),
secondary_school_county VARCHAR(20), residence VARCHAR(15), stud_email VARCHAR(50),
PRIMARY KEY (stud_ID)  );

 * sqlite:///stud_db;
Done.

[]

In [6]:
%%sql
INSERT INTO school_details(stud_ID)
SELECT stud_ID
FROM personal_details;

 * sqlite:///stud_db;
15 rows affected.

[]

In [7]:

%%sql UPDATE school_details
SET stud_email = (
    SELECT REPLACE(stud_name, ' ', '') || '@zinduaschool.ac'
    FROM personal_details
    WHERE school_details.stud_ID = personal_details.stud_ID
);

 * sqlite:///stud_db;
15 rows affected.

[]

In [8]:
%%sql
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud101";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud102";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud103";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud104";
UPDATE school_details SET current_home_county="Nyamira", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud105";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud106";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud107";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Mombasa", residence="Out of school" WHERE stud_ID="stud108";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud109";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud110";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Turkana", residence="In school" WHERE stud_ID="stud111";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud112";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Taita Taveta", residence="In school" WHERE stud_ID="stud113";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud114";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud115";

 * sqlite:///stud_db;
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [9]:
%sql CREATE TABLE contact_details (stud_email VARCHAR(50) , phone_number VARCHAR(15), next_of_kin_name VARCHAR(50),next_of_kin_relation VARCHAR(10), next_of_kin_contacts VARCHAR(13) );

 * sqlite:///stud_db;
Done.

[]

In [10]:
%%sql
INSERT INTO contact_details(phone_number, next_of_kin_name,next_of_kin_relation,next_of_kin_contacts)
VALUES("0712345678","Darius Young","Father","0782382383"),
("0723456781","Lucy Nderitu","Mother","0723238983"),
("0734567812","Jerotich Koech","Mother","0779343126"),
("0745678123","Mwaura Mwangi","Father","0798246347"),
("0756781234","Ian Patrick","Father","0711234453"),
("0767812345","Lebron James","Father","0765439233"),
("0778123456","Magna Carter","Father","0702526243"),
("0781234567","Cindy Wayne","Mother","0747282839"),
("0722345678","Farah Maalim","Mother","0753927482"),
("0733456781","Faiba Mbugua","Father","0713245748"),
("0744567812","John Doe","Father","0725737383"),
("0755678123","Klaus Michealson","Father","0789346276"),
("0766456781","Suluhu Amdany","Mother","0785739259"),
("0741367812","Daisy Auma","Mother","0791344537"),
("0755421123","Getrude Karen","Mother","0765748244");

 * sqlite:///stud_db;
15 rows affected.

[]

In [11]:
%%sql
UPDATE contact_details
SET stud_email = (SELECT school_details.stud_email
FROM school_details, personal_details
WHERE school_details.stud_ID = personal_details.stud_ID
AND personal_details.phone_number = contact_details.phone_number);

 * sqlite:///stud_db;
15 rows affected.

[]

In [12]:
%%sql
ALTER TABLE contact_details
MODIFY stud_email VARCHAR(50) PRIMARY KEY ;

 * sqlite:///stud_db;
(sqlite3.OperationalError) near "MODIFY": syntax error
[SQL: ALTER TABLE contact_details
MODIFY stud_email VARCHAR(50) PRIMARY KEY ;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [13]:
%%sql
CREATE TABLE financial_details (stud_ID VARCHAR(15) ,stud_name VARCHAR(50) ,
sem_fee INTEGER(6) , fee_paid INTEGER(6),
PRIMARY KEY(stud_ID) );

 * sqlite:///stud_db;
Done.

[]

In [14]:
%%sql
INSERT INTO financial_details(stud_ID,stud_name)
SELECT personal_details.stud_ID, personal_details.stud_name
FROM personal_details;

 * sqlite:///stud_db;
15 rows affected.

[]

In [15]:
%sql SELECT * FROM financial_details;

 * sqlite:///stud_db;
Done.

[('stud101', 'Hermione Granger', None, None),
 ('stud102', 'Draco Malfo', None, None),
 ('stud103', 'Jayden Wamashati', None, None),
 ('stud104', 'Ron Weasley', None, None),
 ('stud105', 'Dolores Umbridge', None, None),
 ('stud106', 'Hedwig Tonks', None, None),
 ('stud107', 'Chao Chang', None, None),
 ('stud108', 'Curfew Yaeitpm', None, None),
 ('stud109', 'Chaptr Mukenya', None, None),
 ('stud110', 'Natalie Mpema', None, None),
 ('stud111', 'Crew Nundi', None, None),
 ('stud112', 'Bandi Kagunda', None, None),
 ('stud113', 'Testimony Omolo', None, None),
 ('stud114', 'Career Mpya', None, None),
 ('stud115', 'Deamon Anduro', None, None)]

In [16]:
%%sql
UPDATE financial_details SET sem_fee = 25000, fee_paid=25000 WHERE stud_ID = "stud101";
UPDATE financial_details SET sem_fee= 25000, fee_paid=19000 WHERE stud_ID = "stud102";
UPDATE financial_details SET sem_fee= 21900, fee_paid=20000 WHERE stud_ID = "stud103";
UPDATE financial_details SET sem_fee= 22000, fee_paid=22000 WHERE stud_ID = "stud104";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23400 WHERE stud_ID = "stud105";
UPDATE financial_details SET sem_fee= 25000, fee_paid=27000 WHERE stud_ID = "stud106";
UPDATE financial_details SET sem_fee= 24230, fee_paid=21200 WHERE stud_ID = "stud107";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23500 WHERE stud_ID = "stud108";
UPDATE financial_details SET sem_fee= 25000, fee_paid=24500 WHERE stud_ID = "stud109";
UPDATE financial_details SET sem_fee= 25000, fee_paid=25000 WHERE stud_ID = "stud110";
UPDATE financial_details SET sem_fee= 26000, fee_paid=26000 WHERE stud_ID = "stud111";
UPDATE financial_details SET sem_fee= 25000, fee_paid=20900 WHERE stud_ID = "stud112";
UPDATE financial_details SET sem_fee= 25000, fee_paid=22300 WHERE stud_ID = "stud113";
UPDATE financial_details SET sem_fee= 19000, fee_paid=19000 WHERE stud_ID = "stud114";
UPDATE financial_details SET sem_fee= 20800, fee_paid=20800 WHERE stud_ID = "stud115";

 * sqlite:///stud_db;
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
%%sql
SET SQL_SAFE_UPDATES =1;

 * sqlite:///stud_db;
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET SQL_SAFE_UPDATES =1;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [18]:
%%sql
CREATE VIEW new_stud_details AS
SELECT pd.stud_name, sd.stud_ID, sd.stud_email, cd.phone_number
FROM personal_details pd
JOIN school_details sd ON pd.stud_ID = sd.stud_ID
JOIN contact_details cd ON pd.phone_number = cd.phone_number;

 * sqlite:///stud_db;
Done.

[]

Using JOIN to get the student names, school id, email and phone number

In [19]:
%%sql
CREATE VIEW full_stud_details AS
SELECT pd.*, sd.current_home_county, sd.secondary_school_county, sd.residence, sd.stud_email,
       cd.phone_number, cd.next_of_kin_name, cd.next_of_kin_relation, cd.next_of_kin_contacts,
       fd.sem_fee, fd.fee_paid
FROM personal_details pd
JOIN school_details sd ON pd.stud_ID = sd.stud_ID
JOIN contact_details cd ON pd.phone_number = cd.phone_number
JOIN financial_details fd ON pd.stud_ID = fd.stud_ID;

 * sqlite:///stud_db;
Done.

[]

Table with all the details from contacts to school and financial details

In [20]:
%sql SELECT * FROM full_stud_details;

 * sqlite:///stud_db;
Done.

[(344534, 'stud101', 'Hermione Granger', '0712345678', 20, 'Male', 'Nakuru', 'Nairobi', 'In school', 'HermioneGranger@zinduaschool.ac', '0712345678', 'Darius Young', 'Father', '0782382383', 25000, 25000),
 (379683, 'stud102', 'Draco Malfo', '0723456781', 21, 'Female', 'Nairobi', 'Nakuru', 'In school', 'DracoMalfo@zinduaschool.ac', '0723456781', 'Lucy Nderitu', 'Mother', '0723238983', 25000, 19000),
 (347403, 'stud103', 'Jayden Wamashati', '0734567812', 22, 'Male', 'Samburu', 'Nairobi', 'Out of school', 'JaydenWamashati@zinduaschool.ac', '0734567812', 'Jerotich Koech', 'Mother', '0779343126', 21900, 20000),
 (377302, 'stud104', 'Ron Weasley', '0745678123', 19, 'Female', 'Kericho', 'Nairobi', 'In school', 'RonWeasley@zinduaschool.ac', '0745678123', 'Mwaura Mwangi', 'Father', '0798246347', 22000, 22000),
 (336741, 'stud105', 'Dolores Umbridge', '0756781234', 21, 'Male', 'Nyamira', 'Nakuru', 'In school', 'DoloresUmbridge@zinduaschool.ac', '0756781234', 'Ian Patrick', 'Father', '0711234453', 25000, 23400),
 (307243, 'stud106', 'Hedwig Tonks', '0767812345', 21, 'Female', 'Kisumu', 'Nairobi', 'Out of school', 'HedwigTonks@zinduaschool.ac', '0767812345', 'Lebron James', 'Father', '0765439233', 25000, 27000),
 (310932, 'stud107', 'Chao Chang', '0778123456', 22, 'Male', 'Nakuru', 'Nairobi', 'Out of school', 'ChaoChang@zinduaschool.ac', '0778123456', 'Magna Carter', 'Father', '0702526243', 24230, 21200),
 (343920, 'stud108', 'Curfew Yaeitpm', '0781234567', 20, 'Female', 'Kisumu', 'Mombasa', 'Out of school', 'CurfewYaeitpm@zinduaschool.ac', '0781234567', 'Cindy Wayne', 'Mother', '0747282839', 25000, 23500),
 (345261, 'stud109', 'Chaptr Mukenya', '0722345678', 20, 'Male', 'Kericho', 'Mombasa', 'In school', 'ChaptrMukenya@zinduaschool.ac', '0722345678', 'Farah Maalim', 'Mother', '0753927482', 25000, 24500),
 (339152, 'stud110', 'Natalie Mpema', '0733456781', 21, 'Female', 'Nakuru', 'Mombasa', 'In school', 'NatalieMpema@zinduaschool.ac', '0733456781', 'Faiba Mbugua', 'Father', '0713245748', 25000, 25000),
 (339746, 'stud111', 'Crew Nundi', '0744567812', 20, 'Male', 'Kiambu', 'Turkana', 'In school', 'CrewNundi@zinduaschool.ac', '0744567812', 'John Doe', 'Father', '0725737383', 26000, 26000),
 (336373, 'stud112', 'Bandi Kagunda', '0755678123', 22, 'Female', 'Nairobi', 'Nakuru', 'In school', 'BandiKagunda@zinduaschool.ac', '0755678123', 'Klaus Michealson', 'Father', '0789346276', 25000, 20900),
 (325252, 'stud113', 'Testimony Omolo', '0766456781', 21, 'Male', 'Samburu', 'Taita Taveta', 'In school', 'TestimonyOmolo@zinduaschool.ac', '0766456781', 'Suluhu Amdany', 'Mother', '0785739259', 25000, 22300),
 (321746, 'stud114', 'Career Mpya', '0741367812', 20, 'Male', 'Kericho', 'Nairobi', 'Out of school', 'CareerMpya@zinduaschool.ac', '0741367812', 'Daisy Auma', 'Mother', '0791344537', 19000, 19000)]

In [21]:
%%sql
UPDATE financial_details
SET stud_name = (SELECT stud_name FROM personal_details WHERE personal_details.stud_ID = financial_details.stud_ID)
WHERE stud_name IS NULL OR stud_name = '';

 * sqlite:///stud_db;
0 rows affected.

[]

In [22]:
%%sql
CREATE VIEW financial_details_view AS
SELECT *, IF(fee_paid >= sem_fee, 'True', 'False') AS fee_cleared
FROM financial_details;

 * sqlite:///stud_db;
Done.

[]

In [23]:
%%sql
CREATE VIEW fee_cleared AS
SELECT pd.national_ID, pd.stud_name
FROM personal_details pd
JOIN financial_details fd ON pd.stud_ID = fd.stud_ID
WHERE fd.fee_paid >= fd.sem_fee;

 * sqlite:///stud_db;
Done.

[]

The national ID and name of all students who have cleared their fees.

In [24]:
%%sql
CREATE VIEW total_fee_balance AS
SELECT SUM(fee_paid) AS total_paid, SUM(sem_fee - fee_paid) AS total_deficit
FROM financial_details;

 * sqlite:///stud_db;
Done.

[]

The total sum of fees paid so far and the total current deficit.

In [25]:
%%sql
CREATE VIEW home_county_count AS
SELECT current_home_county, COUNT(*) AS student_count
FROM school_details
GROUP BY current_home_county;

 * sqlite:///stud_db;
Done.

[]

The count of students who share a current home county.

In [26]:
%%sql
CREATE VIEW secondary_school_count AS
SELECT secondary_school_county,
       SUM(CASE WHEN pd.gender = 'Male' THEN 1 ELSE 0 END) AS male_student_count,
       SUM(CASE WHEN pd.gender = 'Female' THEN 1 ELSE 0 END) AS female_student_count
FROM personal_details pd
JOIN school_details sd ON pd.stud_ID = sd.stud_ID
GROUP BY secondary_school_county;

 * sqlite:///stud_db;
Done.

[]

The count of male and female students from each secondary school county.

In [27]:
%%sql
CREATE VIEW kin_percentage AS
SELECT next_of_kin_relation,
       SUM(CASE WHEN next_of_kin_relation = 'Mother' THEN 1 ELSE 0 END) AS mother_count,
       SUM(CASE WHEN next_of_kin_relation = 'Father' THEN 1 ELSE 0 END) AS father_count,
       (SUM(CASE WHEN next_of_kin_relation = 'Mother' THEN 1 ELSE 0 END) / COUNT(*)) * 100 AS mother_percentage,
       (SUM(CASE WHEN next_of_kin_relation = 'Father' THEN 1 ELSE 0 END) / COUNT(*)) * 100 AS father_percentage
FROM contact_details
GROUP BY next_of_kin_relation;

 * sqlite:///stud_db;
Done.

[]

The percentage of tudents who set their next of kin as mother verses those who set it as father.